import Mock from 'mockjs'

const mockData = [{
  guid: 'guid-01',
  title: '常州星河国际四期七区八区三网合一工程',
  date: 1504665679079,
  content: '相关工作内容：\n一、在机房内设置、安装防雷接地系统，并确保通过验收；对机房进行必要装修，使其符合验收的要求，内容包括：敷设地砖、墙面刷漆、敷设强、弱电线槽等（以验收合格为标准）；机房内的设备要进行合理的布局及摆放。\n二、机房内及机房至住户户内的设备采购与安装，包括：\n1）局端配线设施：光配线架等。\n2）各级主段与分段光缆。\n三、数字电视网的所有工作内容不在本次招标范围内。\n四、技术标回标内容包括但不限于：\n1、本工程设计方案、系统图；设计方案必须通过常州市通讯行业协会的审核，并保证按此方案实施能通过常州市通讯行业协会验收；2、本工程的质量目标、安全目标、现场安全文明、施工工期3、项目部署或思路、与总包配合、协调；4、关键部位施工方案技术措施、质量保证措施、进度保证措施、安全文明措施、环境保护措施、成品保护措施；5、管理组织结构、施工组织设计、服务承诺或保修等。'
}, {
  guid: 'guid-02',
  title: '常州星河国际四期七区八区三网合一工程',
  date: 1504644679079,
  content: '相关工作内容：\n一、在机房内设置、安装防雷接地系统，并确保通过验收；对机房进行必要装修，使其符合验收的要求，内容包括：敷设地砖、墙面刷漆、敷设强、弱电线槽等（以验收合格为标准）；机房内的设备要进行合理的布局及摆放。\n二、机房内及机房至住户户内的设备采购与安装，包括：\n1）局端配线设施：光配线架等。\n2）各级主段与分段光缆。\n三、数字电视网的所有工作内容不在本次招标范围内。\n四、技术标回标内容包括但不限于：\n1、本工程设计方案、系统图；设计方案必须通过常州市通讯行业协会的审核，并保证按此方案实施能通过常州市通讯行业协会验收；2、本工程的质量目标、安全目标、现场安全文明、施工工期3、项目部署或思路、与总包配合、协调；4、关键部位施工方案技术措施、质量保证措施、进度保证措施、安全文明措施、环境保护措施、成品保护措施；5、管理组织结构、施工组织设计、服务承诺或保修等。'
}, {
  guid: 'guid-03',
  title: '常州星河国际四期七区八区三网合一工程',
  date: 1503344679079,
  content: '相关工作内容：\n一、在机房内设置、安装防雷接地系统，并确保通过验收；对机房进行必要装修，使其符合验收的要求，内容包括：敷设地砖、墙面刷漆、敷设强、弱电线槽等（以验收合格为标准）；机房内的设备要进行合理的布局及摆放。\n二、机房内及机房至住户户内的设备采购与安装，包括：\n1）局端配线设施：光配线架等。\n2）各级主段与分段光缆。\n三、数字电视网的所有工作内容不在本次招标范围内。\n四、技术标回标内容包括但不限于：\n1、本工程设计方案、系统图；设计方案必须通过常州市通讯行业协会的审核，并保证按此方案实施能通过常州市通讯行业协会验收；2、本工程的质量目标、安全目标、现场安全文明、施工工期3、项目部署或思路、与总包配合、协调；4、关键部位施工方案技术措施、质量保证措施、进度保证措施、安全文明措施、环境保护措施、成品保护措施；5、管理组织结构、施工组织设计、服务承诺或保修等。'
}, {
  guid: 'guid-04',
  title: '常州星河国际四期七区八区三网合一工程',
  date: 1509944679079,
  content: '相关工作内容：\n一、在机房内设置、安装防雷接地系统，并确保通过验收；对机房进行必要装修，使其符合验收的要求，内容包括：敷设地砖、墙面刷漆、敷设强、弱电线槽等（以验收合格为标准）；机房内的设备要进行合理的布局及摆放。\n二、机房内及机房至住户户内的设备采购与安装，包括：\n1）局端配线设施：光配线架等。\n2）各级主段与分段光缆。\n三、数字电视网的所有工作内容不在本次招标范围内。\n四、技术标回标内容包括但不限于：\n1、本工程设计方案、系统图；设计方案必须通过常州市通讯行业协会的审核，并保证按此方案实施能通过常州市通讯行业协会验收；2、本工程的质量目标、安全目标、现场安全文明、施工工期3、项目部署或思路、与总包配合、协调；4、关键部位施工方案技术措施、质量保证措施、进度保证措施、安全文明措施、环境保护措施、成品保护措施；5、管理组织结构、施工组织设计、服务承诺或保修等。'
}]

const mock = Mock.mock('/mock-detail', (options) => {
  if (options.body) {
    const result = mockData.filter((item) => {
      return item.guid === options.body
    })
    console.log(result)
    return result.length > 0 ? {
      result: result[0],
      success: true,
      errMsg: ''
    } : {
      result: {},
      success: false,
      errMsg: '数据查询错误'
    }
  } else {
    return {
      result: {},
      success: false,
      errMsg: '数据查询错误'
    }
  }

})

export default mock